frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rcm.c
/*!
 * @file        apm32l0xx_rcm.c
 *
 * @brief       This file provides all the RCM firmware functions
 *
 * @version     V1.0.0
 *
 * @date        2021-12-25
 *
 * @attention
 *
 *  Copyright (C) 2020-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32l0xx_rcm.h"

/** @addtogroup Peripherals_Library Standard Peripheral Library
  @{
*/

/** @addtogroup RCM_Driver RCM Driver
  @{
*/

/** @addtogroup RCM_Fuctions Fuctions
  @{
*/

/*!
 * @brief   Resets the clock configuration
 *
 * @param   None
 *
 * @retval  None
 */
void RCM_Reset(void)
{
    /** Set MSIEN bit */
    RCM->CTRL_B.MSIEN = BIT_SET;

    /** Set MSIR and HSI16TIM bits to the rest value */
    RCM->ICLKCAL &= (uint32_t)0x00FF00FF;
    RCM->ICLKCAL |= (uint32_t)0x0000B000;

    /** Reset SCLKSEL, AHBPSC, APB1PSC, APB2PSC, MCOSEL and MCOPSC bits */
    RCM->CFG &= (uint32_t)0x80FFC00C;

    /** Reset HSI, HSE, PLL */
    RCM->CTRL &= (uint32_t)0xFEFEFFD4;

    /** Reset HSEBCFG bit */
    RCM->CTRL_B.HSEBCFG = BIT_RESET;

    /** Set RTCPSC to 0b00*/
    RCM->CTRL_B.RTCPSC = BIT_SET;

    /** Reset CFG register */
    RCM->CFG = (uint32_t)0x00000000;

    /** Reset HSI48EN and  HSI48DIVEN bits */
    RCM->HSI48CFG_B.HSI48EN = BIT_RESET;
    RCM->HSI48CFG_B.HSI48DIVEN = BIT_RESET;

    /** Disable all interrupts and interrupt flags */
    RCM->INTEN = (uint32_t)0x00000000;
    RCM->INTCLR = (uint32_t)0xFFFFFFFF;
}

/*!
 * @brief       Configures HSE
 *
 * @param       state: state of the HSE
 *                     This parameter can be one of the following values:
 *                     @arg RCM_HSE_CLOSE: turn OFF the HSE oscillator
 *                     @arg RCM_HSE_OPEN: turn ON the HSE oscillator
 *                     @arg RCM_HSE_BYPASS: HSE oscillator bypassed with external clock
 *
 * @retval      None
 *
 * @note        HSE can not be stopped if it is used directly or through the PLL as system clock
 */
void RCM_ConfigHSE(RCM_HSE_T state)
{
    RCM->CTRL_B.HSEEN = BIT_RESET;

    RCM->CTRL_B.HSEBCFG = BIT_RESET;

    if (state == RCM_HSE_OPEN)
    {
        RCM->CTRL_B.HSEEN = BIT_SET;
    }
    else if (state == RCM_HSE_BYPASS)
    {
        RCM->CTRL_B.HSEBCFG = BIT_SET;
        RCM->CTRL_B.HSEEN = BIT_SET;
    }
}

/*!
 * @brief       Waits for HSE be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     HSE oscillator is stable and ready to use
 *              ERROR       HSE oscillator not yet ready
 */
uint8_t RCM_WaitHSEReady(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CTRL_B.HSERDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Enable HSI16
 *
 * @param       None
 *
 * @retval      None
 *
 * @note        HSI can not be stopped if it is used directly or through the PLL as system clock
 */
void RCM_EnableHSI16(void)
{
    RCM->CTRL_B.HSI16EN = BIT_SET;
}

/*!
 * @brief       Disable HSI16
 *
 * @param       None
 *
 * @retval      None
 *
 * @note        HSI can not be stopped if it is used directly or through the PLL as system clock
 */
void RCM_DisableHSI16(void)
{
    RCM->CTRL_B.HSI16EN = BIT_RESET;
}

/*!
 * @brief       Enable 16MHz High Speed Internal Clock Force Enable
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableHSI16Force(void)
{
    RCM->CTRL_B.HSI16FEN = BIT_SET;
}

/*!
 * @brief       Disable 16MHz High Speed Internal Clock Force Enable
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableHSI16Force(void)
{
    RCM->CTRL_B.HSI16FEN = BIT_RESET;
}

/*!
 * @brief       Enable 16MHz HSI Divider by 4
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableHSI16DIV(void)
{
    RCM->CTRL_B.HSI16DIVEN = BIT_SET;
}

/*!
 * @brief       Disable 16MHz HSI Divider by 4
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableHSI16DIV(void)
{
    RCM->CTRL_B.HSI16DIVEN = BIT_RESET;
}

/*!
 * @brief       Enable HSICLK16 Output
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableHSI16Out(void)
{
    RCM->CTRL_B.HSI16OUTEN = BIT_SET;
}

/*!
 * @brief       Disable HSICLK16 Output
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableHSI16Out(void)
{
    RCM->CTRL_B.HSI16OUTEN = BIT_RESET;
}

/*!
 * @brief       Waits for HSI16 be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     HSI16 oscillator is stable and ready to use
 *              ERROR       HSI16 oscillator not yet ready
 */
uint8_t RCM_WaitHSI16Ready(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CTRL_B.HSI16RDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Waits for HSI16DIV be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     16MHz HSI divider by 4
 *              ERROR       16MHz HSI not divider by 4
 */
uint8_t RCM_WaitHSI16DIVReady(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CTRL_B.HSI16DIVFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Enable MSI
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableMSI(void)
{
    RCM->CTRL_B.MSIEN = BIT_SET;
}

/*!
 * @brief       Disable MSI
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableMSI(void)
{
    RCM->CTRL_B.MSIEN = BIT_RESET;
}

/*!
 * @brief       Waits for MSI be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     MSI oscillator is stable and ready to use
 *              ERROR       MSI oscillator not yet ready
 */
uint8_t RCM_WaitMSIReady(void)
{
    __IO uint32_t cnt;

