frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rcm.c
    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CTRL_B.MSIRDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Enable Clock Security System Enable
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableCSS(void)
{
    RCM->CTRL_B.CSSEN = BIT_SET;
}

/*!
 * @brief       Disable Clock Security System Enable
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableCSS(void)
{
    RCM->CTRL_B.CSSEN = BIT_RESET;
}

/*!
 * @brief       Configures RTC Clock Prescaler Factor Configure
 *
 * @param       state:   state of the RTCPSC
 *                       This parameter can be one of the following values:
 *                       @arg RCM_RTCPSC_2
 *                       @arg RCM_RTCPSC_4
 *                       @arg RCM_RTCPSC_8
 *                       @arg RCM_RTCPSC_16
 *
 * @retval      None
 */
void RCM_ConfigRTC(RCM_RTCPSC_T state)
{
    RCM->CTRL_B.RTCPSC = state;
}

/*!
 * @brief       Enable PLL
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnablePLL(void)
{
    RCM->CTRL_B.PLLEN = BIT_SET;
}

/*!
 * @brief       Disable PLL
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisablePLL(void)
{
    RCM->CTRL_B.PLLEN = BIT_RESET;
}

/*!
 * @brief       Waits for PLL be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     PLL Clock is stable and ready to use
 *              ERROR       PLL Clock not yet ready
 */
uint8_t RCM_WaitPLLReady(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CTRL_B.PLLRDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Set HSI16 trimming value
 *
 * @param        hsi16Trim: HSI16 trimming value
 *                          This parameter must be a number between 0 and 0x1F.
 *
 * @retval      None
 */
void RCM_SetHSI16Trim(uint8_t hsi16Trim)
{
    RCM->ICLKCAL_B.HSI16TMR = hsi16Trim;
}

/*!
 * @brief       Set MSICLK trimming value
 *
 * @param        msiTrim: MSICLK trimming value
 *                        This parameter must be a number between 0 and 0x1F.
 *
 * @retval      None
 */
void RCM_SetMSITrim(uint8_t msiTrim)
{
    RCM->ICLKCAL_B.MSITIM = msiTrim;
}

/*!
 * @brief       Configures MSICLK Frequency Range
 *
 * @param       state: state of the MSICLK Frequency Range
 *                     This parameter can be one of the following values:
 *                     @arg RCM_MSIR_0
 *                     @arg RCM_MSIR_1
 *                     @arg RCM_MSIR_2
 *                     @arg RCM_MSIR_3
 *                     @arg RCM_MSIR_4
 *                     @arg RCM_MSIR_5
 *                     @arg RCM_MSIR_6
 *
 * @retval      None
 */
void RCM_ConfigMSIFreqRange(RCM_MSIR_T state)
{
    RCM->ICLKCAL_B.MSIR = state;
}

/*!
 * @brief       Enable HSI48
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableHSI48(void)
{
    RCM->HSI48CFG_B.HSI48EN = BIT_SET;
}

/*!
 * @brief       Disable HSI48
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableHSI48(void)
{
    RCM->HSI48CFG_B.HSI48EN = BIT_RESET;
}

/*!
 * @brief       Enable HSI48DIV
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableHSI48DIV(void)
{
    RCM->HSI48CFG_B.HSI48DIVEN = BIT_SET;
}

/*!
 * @brief       Disable HSI48DIV
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableHSI48DIV(void)
{
    RCM->HSI48CFG_B.HSI48DIVEN = BIT_RESET;
}

/*!
 * @brief       Waits for HSI48 be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     HSI48 is stable and ready to use
 *              ERROR       HSI48 not yet ready
 */
uint8_t RCM_WaitHSI48Ready(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->HSI48CFG_B.HSI48RDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Configures the system clock
 *
 * @param       sysClkSelect:   specifies the clock source used as system clock
 *                              This parameter can be one of the following values:
 *                              @arg RCM_SYSCLK_SEL_MSI:  MSI selected as system clock source
 *                              @arg RCM_SYSCLK_SEL_HSI16:  HSI16 selected as system clock source
 *                              @arg RCM_SYSCLK_SEL_HSE:  HSE selected as system clock source
 *                              @arg RCM_SYSCLK_SEL_PLL:  PLL selected as system clock source,It's only for 072 devices
 *
 * @retval      None
 */
void RCM_ConfigSYSClock(RCM_SYSCLK_SEL_T sysClkSelect)
{
    RCM->CFG_B.SCLKSEL = sysClkSelect;
}

/*!
 * @brief       returns the clock source used as system clock
 *
 * @param       None
 *
 * @retval      The clock source used as system clock
 */
RCM_SYSCLK_SEL_T RCM_ReadSYSClockSource(void)
{
    RCM_SYSCLK_SEL_T sysClock;

    sysClock = (RCM_SYSCLK_SEL_T)RCM->CFG_B.SCLKSWSTS;

    return sysClock;
}

/*!
 * @brief       Configures the AHB clock
 *
 * @param       ahbDiv:   AHB divider number. This clock is derived from the system clock (SYSCLK)
 *                        This parameter can be one of the following values:
 *                        @arg RCM_SYSCLK_DIV_1:   AHB clock = SYSCLK
 *                        @arg RCM_SYSCLK_DIV_2:   AHB clock = SYSCLK/2
 *                        @arg RCM_SYSCLK_DIV_4:   AHB clock = SYSCLK/4
 *                        @arg RCM_SYSCLK_DIV_8:   AHB clock = SYSCLK/8
 *                        @arg RCM_SYSCLK_DIV_16:  AHB clock = SYSCLK/16
 *                        @arg RCM_SYSCLK_DIV_64:  AHB clock = SYSCLK/64
 *                        @arg RCM_SYSCLK_DIV_128: AHB clock = SYSCLK/128
 *                        @arg RCM_SYSCLK_DIV_256: AHB clock = SYSCLK/256
 *                        @arg RCM_SYSCLK_DIV_512: AHB clock = SYSCLK/512
 *
 * @retval      None
 */
void RCM_ConfigAHB(RCM_AHBDIV_T ahbDiv)
{
    RCM->CFG_B.AHBPSC = ahbDiv;
}

/*!
 * @brief       Configures the APB1 clock
 *
 * @param       apbDiv:   defines the APB clock divider. This clock is derived from the AHB clock (HCLK)
 *                        This parameter can be one of the following values:
 *                        @arg RCM_HCLK_DIV_1:  APB clock = HCLK
 *                        @arg RCM_HCLK_DIV_2:  APB clock = HCLK/2
 *                        @arg RCM_HCLK_DIV_4:  APB clock = HCLK/4
 *                        @arg RCM_HCLK_DIV_8:  APB clock = HCLK/8
 *                        @arg RCM_HCLK_DIV_16: APB clock = HCLK/16
 *
 * @retval      None
 */
void RCM_ConfigAPB1(RCM_APBDIV_T apbDiv)
{
    RCM->CFG_B.APB1PSC = apbDiv;
}

/*!
 * @brief       Configures the APB2 clock
 *
 * @param       apbDiv:   defines the APB clock divider. This clock is derived from the AHB clock (HCLK)
 *                        This parameter can be one of the following values:
 *                        @arg RCM_HCLK_DIV_1:  APB clock = HCLK
 *                        @arg RCM_HCLK_DIV_2:  APB clock = HCLK/2
 *                        @arg RCM_HCLK_DIV_4:  APB clock = HCLK/4
 *                        @arg RCM_HCLK_DIV_8:  APB clock = HCLK/8
 *                        @arg RCM_HCLK_DIV_16: APB clock = HCLK/16
 *
 * @retval      None
 */
void RCM_ConfigAPB2(RCM_APBDIV_T apbDiv)
{
    RCM->CFG_B.APB2PSC = apbDiv;
}

/*!
 * @brief       Configures the clock wake up from STOP moudle
 *
 * @param       wuClkSelect:   specifies the clock source used as system clock
 *                              This parameter can be one of the following values:
 *                              @arg RCM_WUCLK_SEL_MSI
 *                              @arg RCM_WUCLK_SEL_HSI16
 *
 * @retval      None
 */
void RCM_ConfigWakeUpClock(RCM_WUCLK_SEL_T wuClkSelect)
{
    RCM->CFG_B.WUCLKSEL = wuClkSelect;
}

/*!
 * @brief       Configures the PLL Input Clock
 *
 * @param       pllInSelect:   This parameter can be one of the following values:
 *                              @arg RCM_PLLIN_SEL_HSI16
 *                              @arg RCM_PLLIN_SEL_HSE
 *
 * @retval      None
 */
void RCM_ConfigPLLInClock(RCM_PLLIN_SEL_T pllInSelect)
{
    RCM->CFG_B.PLLINSEL = pllInSelect;
}

/*!
 * @brief       Configures the PLL Multiplication Factor
 *
 * @param       pllMul:   This parameter can be one of the following values:
 *                        @arg RCM_PLL_MUL_3
 *                        @arg RCM_PLL_MUL_4
 *                        @arg RCM_PLL_MUL_6
 *                        @arg RCM_PLL_MUL_8
 *                        @arg RCM_PLL_MUL_12
 *                        @arg RCM_PLL_MUL_16
 *                        @arg RCM_PLL_MUL_24
 *                        @arg RCM_PLL_MUL_32
 *                        @arg RCM_PLL_MUL_48
 *
 * @retval      VCO = PLLCLK*pllMul
 */
void RCM_ConfigPLLMUL(RCM_PLL_MUL_T pllMul)
{
    RCM->CFG_B.PLLMUL = pllMul;
}

/*!
 * @brief       Configures the PLL Output Clock Divider Factor
 *
 * @param       pllOutDiv:   This parameter can be one of the following values:
 *                           @arg RCM_PLLOUT_DIV_2
 *                           @arg RCM_PLLOUT_DIV_3
 *                           @arg RCM_PLLOUT_DIV_4
 *
 * @retval      f output = VCO/PLLOUTDIV
 */
void RCM_ConfigPLLOut(RCM_PLLOUT_DIV_T pllOutDiv)
{
    RCM->CFG_B.PLLOUTDIV = pllOutDiv;
}

/*!
 * @brief       Selects MCO clock ouput source
 *
 * @param       mcoClock:  specifies the MCO clock source to output
 *                         This parameter can be one of the following values:
 *                         @arg RCM_MCO_SEL_NOCLOCK
 *                         @arg RCM_MCO_SEL_SYS
 *                         @arg RCM_MCO_SEL_HSI16
 *                         @arg RCM_MCO_SEL_MSI
 *                         @arg RCM_MCO_SEL_HSE
 *                         @arg RCM_MCO_SEL_PLL
 *                         @arg RCM_MCO_SEL_LSI
 *                         @arg RCM_MCO_SEL_LSE
 *                         @arg RCM_MCO_SEL_HSI
 *
 * @retval      None
 */
void RCM_ConfigMCOClock(RCM_MCO_SEL_T mcoClock)
{
    RCM->CFG_B.MCOSEL = mcoClock;
}

/*!
 * @brief       Configures MCO Clock Output Prescaler Factor
 *
 * @param       mcoPsc:   This parameter can be one of the following values:
 *                           @arg RCM_MCO_PSC_1
 *                           @arg RCM_MCO_PSC_2
 *                           @arg RCM_MCO_PSC_4
 *                           @arg RCM_MCO_PSC_8
 *                           @arg RCM_MCO_PSC_16
 *
 * @retval      None
 */
void RCM_ConfigMCO(RCM_MCO_PSC_T mcoPsc)
{
    RCM->CFG_B.MCOPSC = mcoPsc;
}

/*!
 * @brief       Configures the USART1 clock
 *
 * @param       usart1Clk:   defines the USART1 clock divider.
 *                           This parameter can be one of the following values:
 *                           @arg RCM_CLKS_CEL_APB
 *                           @arg RCM_CLKS_CEL_SYS
 *                           @arg RCM_CLKS_CEL_HSI16
 *                           @arg RCM_CLKS_CEL_LSE
 *
 * @retval      None
 */
void RCM_ConfigUSART1Clock(RCM_CLKS_CEL_T usart1Clk)
{
    RCM->CLKSEL_B.USART1SEL = usart1Clk;
}

/*!
 * @brief       Configures the USART2 clock
 *
 * @param       usart2Clk:   defines the USART2 clock divider.
 *                           This parameter can be one of the following values:
 *                           @arg RCM_CLKS_CEL_APB
 *                           @arg RCM_CLKS_CEL_SYS
 *                           @arg RCM_CLKS_CEL_HSI16
 *                           @arg RCM_CLKS_CEL_LSE
 *
 * @retval      None
 */
void RCM_ConfigUSART2Clock(RCM_CLKS_CEL_T usart2Clk)
{
    RCM->CLKSEL_B.USART2SEL = usart2Clk;
}

/*!
 * @brief       Configures the LPUART1 clock
 *
 * @param       lpUart1Clk:   defines the LPUART1 clock divider.
 *                           This parameter can be one of the following values:
 *                           @arg RCM_CLKS_CEL_APB
 *                           @arg RCM_CLKS_CEL_SYS
 *                           @arg RCM_CLKS_CEL_HSI16
 *                           @arg RCM_CLKS_CEL_LSE
 *
 * @retval      None
 */
void RCM_ConfigLPUART1Clock(RCM_CLKS_CEL_T lpUart1Clk)
{
    RCM->CLKSEL_B.LPUART1SEL = lpUart1Clk;
}

/*!
 * @brief       Configures the I2C1 clock
 *
 * @param       i2c1Clk:   defines the I2C1 clock divider.
 *                         This parameter can be one of the following values:
 *                         @arg RCM_CLKS_CEL_APB
 *                         @arg RCM_CLKS_CEL_SYS
 *                         @arg RCM_CLKS_CEL_HSI16
 *
 * @retval      None
 */
void RCM_ConfigI2C1Clock(RCM_CLKS_CEL_T i2c1Clk)
{
    RCM->CLKSEL_B.I2C1SEL = i2c1Clk;
}

/*!
 * @brief       Configures the I2C3 clock
 *
 * @param       i2c3Clk:   defines the I2C3 clock divider.
 *                         This parameter can be one of the following values:
 *                         @arg RCM_CLKS_CEL_APB
 *                         @arg RCM_CLKS_CEL_SYS
 *                         @arg RCM_CLKS_CEL_HSI16
 *
 * @retval      None
 */
void RCM_ConfigI2C3Clock(RCM_CLKS_CEL_T i2c3Clk)
{
    RCM->CLKSEL_B.I2C3SEL = i2c3Clk;
}

/*!
 * @brief       Configures the LPTMR1 clock
 *
 * @param       lpTmr1Clk:   defines the LPTMR1 clock divider.
 *                           This parameter can be one of the following values:
 *                           @arg RCM_LPTMR1_CLKS_APB
 *                           @arg RCM_LPTMR1_CLKS_LSI
 *                           @arg RCM_LPTMR1_CLKS_HSI
 *                           @arg RCM_LPTMR1_CLKS_LSE
 *
 * @retval      None
 */
void RCM_ConfigLPTMR1Clock(RCM_LPTMR1_CLKS_T lpTmr1Clk)
{
    RCM->CLKSEL_B.LPTMR1SEL = lpTmr1Clk;
}

/*!
 * @brief       Configures the HSICLK48 clock
 *
 * @param       hsi48Clk:   defines the HSICLK48 clock divider.
 *                          This parameter can be one of the following values:
 *                          @arg RCM_HSI48_SEL_PLL_USB
 *                          @arg RCM_HSI48_SEL_HSI48
 *
 * @retval      None
 */
void RCM_ConfigHSI48Clock(RCM_HSI48_SEL_T hsi48Clk)
{
    RCM->CLKSEL_B.HSI48SEL = hsi48Clk;
}

/*!
 * @brief       Enable Low-Speed Internal Oscillator
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableLSI(void)
{
    RCM->CSTS_B.LSIEN = BIT_SET;
}

/*!
 * @brief       Disable Low-Speed Internal Oscillator
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableLSI(void)
{
    RCM->CSTS_B.LSIEN = BIT_RESET;
}

/*!
 * @brief       Waits for LSI be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     LSI oscillator is stable and ready to use
 *              ERROR       LSI oscillator not yet ready
 */
uint8_t RCM_WaitLSIReady(void)
{
    __IO uint32_t cnt;

