frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rcm.c
    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CSTS_B.LSIRDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Configures LSE
 *
 * @param       state:   state of the LSE
 *                       This parameter can be one of the following values:
 *                       @arg RCM_LSE_CLOSE: turn OFF the LSE oscillator
 *                       @arg RCM_LSE_OPEN: turn ON the LSE oscillator
 *                       @arg RCM_LSE_BYPASS: LSE oscillator bypassed with external clock
 *
 * @retval      None
 */
void RCM_ConfigLSE(RCM_LSE_T state)
{
    RCM->CSTS_B.LSEEN = BIT_RESET;

    RCM->CSTS_B.LSEBCFG = BIT_RESET;

    if (state == RCM_LSE_OPEN)
    {
        RCM->CSTS_B.LSEEN = BIT_SET;
    }
    else if (state == RCM_LSE_BYPASS)
    {
        RCM->CSTS_B.LSEBCFG = BIT_SET;
        RCM->CSTS_B.LSEEN = BIT_SET;
    }
}

/*!
 * @brief       Waits for LSE be ready
 *
 * @param       None
 *
 * @retval      SUCCESS     LSE oscillator is stable and ready to use
 *              ERROR       LSE oscillator not yet ready
 */
uint8_t RCM_WaitLSEReady(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < (uint32_t)0x5000; cnt++)
    {
        if (RCM->CSTS_B.LSERDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }
    return ERROR;
}

/*!
 * @brief       Configures LSE drive capability
 *
 * @param       state:   State of the LSE Drive
 *                       This parameter can be one of the following values:
 *                       @arg RCM_LSE_DRIVE_Low: LSE oscillator low drive capability.
 *                       @arg RCM_LSE_DRIVE_MediumLow: LSE oscillator medium low drive capability.
 *                       @arg RCM_LSE_DRIVE_MediumHigh: LSE oscillator medium high drive capability.
 *                       @arg RCM_LSE_DRIVE_High: LSE oscillator high drive capability.
 *
 * @retval      None
 */
void RCM_ConfigDriveLSE(RCM_LSE_DRIVE_T state)
{
    RCM->CSTS_B.LSEDRIVE = state;
}

/*!
 * @brief        Enable Clock Security System on LSE Clock
 *
 * @param        None
 *
 * @retval       None
 *
 * @note         This position can be set to 1 only after lsiclk and lsiclk are enabled and ready.
 */
void RCM_EnableCSSLSE(void)
{
    RCM->CSTS_B.CSSLEN = BIT_SET;
}

/*!
 * @brief        Disable Clock Security System on LSE Clock
 *
 * @param        None
 *
 * @retval       None
 */
void RCM_DisableCSSLSE(void)
{
    RCM->CSTS_B.CSSLEN = BIT_RESET;
}

/*!
 * @brief       CSS on LSECLK Detecte Failure Flag
 *
 * @param       None
 *
 * @retval      SUCCESS     CSS on LSECLK fault detected
 *              ERROR       CSS on LSECLK not fault detected
 */
uint8_t RCM_CSSLSEFail(void)
{
    if (RCM->CSTS_B.CSSLFAIL == BIT_SET)
    {
        return SUCCESS;
    }
    return ERROR;
}

/*!
 * @brief       Selects RTC Clock Source
 *
 * @param       rtcClock:  This parameter can be one of the following values:
 *                         @arg RCM_RTC_SEL_LSE
 *                         @arg RCM_RTC_SEL_LSI
 *                         @arg RCM_RTC_SEL_HSE
 *
 * @retval      None
 */
void RCM_ConfigRTCClock(RCM_RTC_SEL_T rtcClock)
{
    RCM->CSTS_B.RTCSEL = rtcClock;
}

/*!
 * @brief       Enable RTC Clock
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableRTCClock(void)
{
    RCM->CSTS_B.RTCEN = BIT_SET;
}

/*!
 * @brief       Disable RTC Clock
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableRTCClock(void)
{
    RCM->CSTS_B.RTCEN = BIT_RESET;
}

/*!
 * @brief       Enable RTC Reset
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_EnableRTCReset(void)
{
    RCM->CSTS_B.RTCRST = BIT_SET;
}

/*!
 * @brief       Disable RTC Reset
 *
 * @param       None
 *
 * @retval      None
 */
void RCM_DisableRTCReset(void)
{
    RCM->CSTS_B.RTCRST = BIT_RESET;
}

/*!
 * @brief       Read frequency of SYSCLK
 *
 * @param       None
 *
 * @retval      Return frequency of SYSCLK
 */
uint32_t RCM_ReadSYSClockFreq(void)
{
    uint32_t sysClock = 0, pllmul = 0, plldiv = 0, pllsource = 0, msirange = 0;
    const uint8_t PLLMulTable[9] = {3, 4, 6, 8, 12, 16, 24, 32, 48};

    sysClock = RCM->CFG_B.SCLKSWSTS;

    switch (sysClock)
    {
        /** sys clock is MSI */
        case 0:
            msirange = RCM->ICLKCAL_B.MSIR;
            SystemCoreClock = (32768 * (1 << (msirange + 1)));
            break;

        /** sys clock is HSI16 */
        case 1:
            SystemCoreClock = HSI16_VALUE;
            break;

        /** sys clock is HSE */
        case 2:
            SystemCoreClock = HSE_VALUE;
            break;

        /** sys clock is PLL */
        case 3:
            /** Get PLL clock source and multiplication factor */
            pllmul = PLLMulTable[RCM->CFG_B.PLLMUL];
            plldiv = RCM->CFG_B.PLLOUTDIV+1;
            pllsource = RCM->CFG_B.PLLINSEL;

            if (pllsource == 0)
            {
                /** HSI16 oscillator clock selected as PLL clock entry */
                SystemCoreClock = (((HSI16_VALUE) * pllmul) / plldiv);
            }
            else
            {
                /** HSE selected as PLL clock entry */
                SystemCoreClock = (((HSE_VALUE) * pllmul) / plldiv);
            }
            break;

        /** MSI used as system clock */
        default:
            msirange = RCM->ICLKCAL_B.MSIR;
            SystemCoreClock = (32768 * (1 << (msirange + 1)));
        break;
    }

    return SystemCoreClock;
}

/*!
 * @brief       Read frequency of AHBCLK
 *
 * @param       None
 *
 * @retval      Return frequency of AHBCLK
 */
uint32_t RCM_ReadAHBClockFreq(void)
{
    uint32_t divider;
    uint32_t sysClk, ahbClk;
    uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

