frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rcm.c
    sysClk = RCM_ReadSYSClockFreq();
    divider = AHBPrescTable[RCM->CFG_B.AHBPSC];
    ahbClk = sysClk >> divider;

    return ahbClk;
}

/*!
 * @brief       Read frequency of APB1CLK
 *
 * @param       None
 *
 * @retval      apb1Clk   return frequency of APB1CLK
 */
uint32_t RCM_ReadAPB1ClockFreq(void)
{
    uint32_t ahbClk, apb1Clk, divider;
    uint8_t APBPrescTable[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    ahbClk = RCM_ReadSYSClockFreq();

    divider = APBPrescTable[RCM->CFG_B.APB1PSC];
    apb1Clk = ahbClk >> divider;

    return apb1Clk;
}

/*!
 * @brief       Read frequency of APB2CLK
 *
 * @param       None
 *
 * @retval      apb2Clk   return frequency of APB2CLK
 */
uint32_t RCM_ReadAPB2ClockFreq(void)
{
    uint32_t ahbClk, apb2Clk, divider;
    uint8_t APBPrescTable[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    ahbClk = RCM_ReadSYSClockFreq();

    divider = APBPrescTable[RCM->CFG_B.APB2PSC];
    apb2Clk = ahbClk >> divider;

    return apb2Clk;
}

/*!
 * @brief       Read frequency of PLLCLK
 *
 * @param       None
 *
 * @retval      pllClk   return frequency of PLLCLK
 */
uint32_t RCM_ReadPLLClockFreq(void)
{
    uint32_t pllmul, plldiv, pllsource, pllClk;
    const uint8_t PLLMulTable[9] = {3, 4, 6, 8, 12, 16, 24, 32, 48};

    pllmul = PLLMulTable[(RCM->CFG_B.PLLMUL)];
    plldiv = RCM->CFG_B.PLLOUTDIV+1;

    pllsource = RCM->CFG_B.PLLINSEL;

    if (pllsource == 0)
    {
        if(RCM->CTRL_B.HSI16DIVFLG == BIT_SET)
        {
            pllClk = (((HSI16_VALUE/4) * pllmul) / plldiv);
        }
        else
        {
            pllClk = (((HSI16_VALUE) * pllmul) / plldiv);
        }
    }
    else
    {
        pllClk = (((HSE_VALUE) * pllmul) / plldiv);
    }
    return pllClk;
}

/*!
 * @brief       Read frequency of USART1 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of USART1 CLK
 */
uint32_t RCM_ReadUSART1ClockFreq(void)
{
    uint32_t usart1Clk = 0;

    if (RCM->CLKSEL_B.USART1SEL==0x00)
    {
        usart1Clk = RCM_ReadAPB2ClockFreq();
    }
    else if (RCM->CLKSEL_B.USART1SEL==0x01)
    {
        usart1Clk = RCM_ReadSYSClockFreq();
    }
    else if (RCM->CLKSEL_B.USART1SEL==0x02)
    {
        usart1Clk = HSI16_VALUE;
    }
    else if (RCM->CLKSEL_B.USART1SEL==0x03)
    {
        usart1Clk = LSE_VALUE;
    }

    return usart1Clk;
}

/*!
 * @brief       Read frequency of USART2 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of USART2 CLK
 */
uint32_t RCM_ReadUSART2ClockFreq(void)
{
    uint32_t usart2Clk = 0;

    if (RCM->CLKSEL_B.USART2SEL==0x00)
    {
        usart2Clk = RCM_ReadAPB1ClockFreq();
    }
    else if (RCM->CLKSEL_B.USART2SEL==0x01)
    {
        usart2Clk = RCM_ReadSYSClockFreq();
    }
    else if (RCM->CLKSEL_B.USART2SEL==0x02)
    {
        usart2Clk = HSI16_VALUE;
    }
    else if (RCM->CLKSEL_B.USART2SEL==0x03)
    {
        usart2Clk = LSE_VALUE;
    }

    return usart2Clk;
}

/*!
 * @brief       Read frequency of LPUART1 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of LPUART1 CLK
 */
uint32_t RCM_ReadLPUART1ClockFreq(void)
{
    uint32_t lpUsart1Clk = 0;

    if (RCM->CLKSEL_B.LPUART1SEL==0x00)
    {
        lpUsart1Clk = RCM_ReadAPB1ClockFreq();
    }
    else if (RCM->CLKSEL_B.LPUART1SEL==0x01)
    {
        lpUsart1Clk = RCM_ReadSYSClockFreq();
    }
    else if (RCM->CLKSEL_B.LPUART1SEL==0x02)
    {
        lpUsart1Clk = HSI16_VALUE;
    }
    else if (RCM->CLKSEL_B.LPUART1SEL==0x03)
    {
        lpUsart1Clk = LSE_VALUE;
    }

    return lpUsart1Clk;
}

/*!
 * @brief       Read frequency of I2C1 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of I2C1 CLK
 */
uint32_t RCM_ReadI2C1ClockFreq(void)
{
    uint32_t i2c1Clk = 0;

    if (RCM->CLKSEL_B.I2C1SEL==0x00)
    {
        i2c1Clk = RCM_ReadAPB1ClockFreq();
    }
    else if (RCM->CLKSEL_B.I2C1SEL==0x01)
    {
        i2c1Clk = RCM_ReadSYSClockFreq();
    }
    else if (RCM->CLKSEL_B.I2C1SEL==0x02)
    {
        i2c1Clk = HSI16_VALUE;
    }

    return i2c1Clk;
}

/*!
 * @brief       Read frequency of I2C3 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of I2C3 CLK
 */
uint32_t RCM_ReadI2C3ClockFreq(void)
{
    uint32_t i2c3Clk = 0;

    if (RCM->CLKSEL_B.I2C3SEL==0x00)
    {
        i2c3Clk = RCM_ReadAPB1ClockFreq();
    }
    else if (RCM->CLKSEL_B.I2C3SEL==0x01)
    {
        i2c3Clk = RCM_ReadSYSClockFreq();
    }
    else if (RCM->CLKSEL_B.I2C3SEL==0x02)
    {
        i2c3Clk = HSI16_VALUE;
    }

    return i2c3Clk;
}

/*!
 * @brief       Read frequency of LPTMR1 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of LPTMR1 CLK
 */
uint32_t RCM_ReadLPTMR1ClockFreq(void)
{
    uint32_t lpTmr1Clk = 0;

    if (RCM->CLKSEL_B.LPTMR1SEL==0x00)
    {
        lpTmr1Clk = RCM_ReadAPB1ClockFreq();
    }
    else if (RCM->CLKSEL_B.LPTMR1SEL==0x01)
    {
        lpTmr1Clk = RCM_ReadSYSClockFreq();
    }
    else if (RCM->CLKSEL_B.LPTMR1SEL==0x02)
    {
        lpTmr1Clk = HSI16_VALUE;
    }
    else if (RCM->CLKSEL_B.LPTMR1SEL==0x03)
    {
        lpTmr1Clk = LSE_VALUE;
    }

    return lpTmr1Clk;
}

/*!
 * @brief       Read frequency of HSI48 CLK
 *
 * @param       None
 *
 * @retval      Return frequency of HSI48 CLK
 */
uint32_t RCM_ReadHSI48ClockFreq(void)
{
    uint32_t hsi48Clk;

    if (RCM->CLKSEL_B.HSI48SEL==0x00)
    {
        hsi48Clk = RCM_ReadPLLClockFreq();
    }
    else
    {
        hsi48Clk = HSI48_VALUE;
    }

    return hsi48Clk;
}

/*!
 * @brief       Enables GPIO clock
 *
 * @param       gpioClock:   specifies the GPIO to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_GPIO_CLOCK_A
 *                           @arg RCM_GPIO_CLOCK_B
 *                           @arg RCM_GPIO_CLOCK_C
 *                           @arg RCM_GPIO_CLOCK_D
 *                           @arg RCM_GPIO_CLOCK_E
 *                           @arg RCM_GPIO_CLOCK_H
 *
 * @retval      None
 */
void RCM_EnableGPIOClock(uint32_t gpioClock)
{
    RCM->GPIOEN |= gpioClock;
}

/*!
 * @brief       Disable GPIO clock
 *
 * @param       gpioClock:   specifies the GPIO to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_GPIO_CLOCK_A
 *                           @arg RCM_GPIO_CLOCK_B
 *                           @arg RCM_GPIO_CLOCK_C
 *                           @arg RCM_GPIO_CLOCK_D
 *                           @arg RCM_GPIO_CLOCK_E
 *                           @arg RCM_GPIO_CLOCK_H
 *
 * @retval      None
 */
void RCM_DisableGPIOClock(uint32_t gpioClock)
{
    RCM->GPIOEN &= (uint32_t)~gpioClock;
}

/*!
 * @brief       Enables AHB peripheral clock
 *
 * @param       AHBPeriph:   specifies the AHB peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_AHB_PERIPH_DMA
 *                           @arg RCM_AHB_PERIPH_MEMITF
 *                           @arg RCM_AHB_PERIPH_CRC
 *                           @arg RCM_AHB_PERIPH_TSC
 *                           @arg RCM_AHB_PERIPH_RNG
 *                           @arg RCM_AHB_PERIPH_CRYP
 *
 * @retval      None
 */
void RCM_EnableAHBPeriphClock(RCM_AHB_PERIPH_T AHBPeriph)
{
    RCM->AHBEN |= AHBPeriph;
}

/*!
 * @brief       Disable AHB peripheral clock
 *
 * @param       AHBPeriph:   specifies the AHB peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_AHB_PERIPH_DMA
 *                           @arg RCM_AHB_PERIPH_MEMITF
 *                           @arg RCM_AHB_PERIPH_CRC
 *                           @arg RCM_AHB_PERIPH_TSC
 *                           @arg RCM_AHB_PERIPH_RNG
 *                           @arg RCM_AHB_PERIPH_CRYP
 *
 * @retval      None
 */
void RCM_DisableAHBPeriphClock(RCM_AHB_PERIPH_T AHBPeriph)
{
    RCM->AHBEN &= (uint32_t)~AHBPeriph;
}

/*!
 * @brief       Enables APB2 peripheral clock
 *
 * @param       APB2Periph:  specifies the APB2 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB2_PERIPH_SYSCFG
 *                           @arg RCM_APB2_PERIPH_TMR21
 *                           @arg RCM_APB2_PERIPH_TMR22
 *                           @arg RCM_APB2_PERIPH_FWL
 *                           @arg RCM_APB2_PERIPH_ADC
 *                           @arg RCM_APB2_PERIPH_SPI1
 *                           @arg RCM_APB2_PERIPH_USART1
 *                           @arg RCM_APB2_PERIPH_DBG
 *
 * @retval      None
 */
void RCM_EnableAPB2PeriphClock(RCM_APB2_PERIPH_T APB2Periph)
{
    RCM->APB2EN |= APB2Periph;
}

/*!
 * @brief       Disable APB2 peripheral clock
 *
 * @param       APB2Periph:  specifies the APB2 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB2_PERIPH_SYSCFG
 *                           @arg RCM_APB2_PERIPH_TMR21
 *                           @arg RCM_APB2_PERIPH_TMR22
 *                           @arg RCM_APB2_PERIPH_FWL
 *                           @arg RCM_APB2_PERIPH_ADC
 *                           @arg RCM_APB2_PERIPH_SPI1
 *                           @arg RCM_APB2_PERIPH_USART1
 *                           @arg RCM_APB2_PERIPH_DBG
 *
 * @retval      None
 */
void RCM_DisableAPB2PeriphClock(RCM_APB2_PERIPH_T APB2Periph)
{
    RCM->APB2EN &= (uint32_t)~APB2Periph;
}

/*!
 * @brief       Enables APB1 peripheral clock
 *
 * @param       APB1Periph:  specifies the APB1 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB1_PERIPH_TMR2
 *                           @arg RCM_APB1_PERIPH_TMR3
 *                           @arg RCM_APB1_PERIPH_TMR6
 *                           @arg RCM_APB1_PERIPH_TMR7
 *                           @arg RCM_APB1_PERIPH_LCD
 *                           @arg RCM_APB1_PERIPH_WWDT
 *                           @arg RCM_APB1_PERIPH_SPI2
 *                           @arg RCM_APB1_PERIPH_USART2
 *                           @arg RCM_APB1_PERIPH_LPUSART1
 *                           @arg RCM_APB1_PERIPH_USART4
 *                           @arg RCM_APB1_PERIPH_USART5
 *                           @arg RCM_APB1_PERIPH_I2C1
 *                           @arg RCM_APB1_PERIPH_I2C2
 *                           @arg RCM_APB1_PERIPH_USB
 *                           @arg RCM_APB1_PERIPH_CRS
 *                           @arg RCM_APB1_PERIPH_PMU
 *                           @arg RCM_APB1_PERIPH_DAC
 *                           @arg RCM_APB1_PERIPH_I2C3
 *                           @arg RCM_APB1_PERIPH_LPTMR1
 *
 * @retval      None
 */
void RCM_EnableAPB1PeriphClock(RCM_APB1_PERIPH_T APB1Periph)
{
    RCM->APB1EN |= APB1Periph;
}

/*!
 * @brief       Disable APB1 peripheral clock
 *
 * @param       APB1Periph:  specifies the APB1 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB1_PERIPH_TMR2
 *                           @arg RCM_APB1_PERIPH_TMR3
 *                           @arg RCM_APB1_PERIPH_TMR6
 *                           @arg RCM_APB1_PERIPH_TMR7
 *                           @arg RCM_APB1_PERIPH_LCD
 *                           @arg RCM_APB1_PERIPH_WWDT
 *                           @arg RCM_APB1_PERIPH_SPI2
 *                           @arg RCM_APB1_PERIPH_USART2
 *                           @arg RCM_APB1_PERIPH_LPUSART1
 *                           @arg RCM_APB1_PERIPH_USART4
 *                           @arg RCM_APB1_PERIPH_USART5
 *                           @arg RCM_APB1_PERIPH_I2C1
 *                           @arg RCM_APB1_PERIPH_I2C2
 *                           @arg RCM_APB1_PERIPH_USB
 *                           @arg RCM_APB1_PERIPH_CRS
 *                           @arg RCM_APB1_PERIPH_PMU
 *                           @arg RCM_APB1_PERIPH_DAC
 *                           @arg RCM_APB1_PERIPH_I2C3
 *                           @arg RCM_APB1_PERIPH_LPTMR1
 *
 * @retval      None
 */
void RCM_DisableAPB1PeriphClock(RCM_APB1_PERIPH_T APB1Periph)
{
    RCM->APB1EN &= (uint32_t)~APB1Periph;
}

/*!
 * @brief       Enables SLPGPIO clock
 *
 * @param       gpioClock:   specifies the SLPGPIO to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_GPIO_CLOCK_A
 *                           @arg RCM_GPIO_CLOCK_B
 *                           @arg RCM_GPIO_CLOCK_C
 *                           @arg RCM_GPIO_CLOCK_D
 *                           @arg RCM_GPIO_CLOCK_E
 *                           @arg RCM_GPIO_CLOCK_H
 *
 * @retval      None
 */
void RCM_EnableSleepGPIOClock(RCM_GPIO_CLOCK_T gpioClock)
{
    RCM->SLPGPIOEN |= gpioClock;
}

/*!
 * @brief       Disable SLPGPIO clock
 *
 * @param       gpioClock:   specifies the SLPGPIO to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_GPIO_CLOCK_A
 *                           @arg RCM_GPIO_CLOCK_B
 *                           @arg RCM_GPIO_CLOCK_C
 *                           @arg RCM_GPIO_CLOCK_D
 *                           @arg RCM_GPIO_CLOCK_E
 *                           @arg RCM_GPIO_CLOCK_H
 *
 * @retval      None
 */
void RCM_DisableSleepGPIOClock(RCM_GPIO_CLOCK_T gpioClock)
{
    RCM->SLPGPIOEN &= (uint32_t)~gpioClock;
}

/*!
 * @brief       Enables AHB peripheral clock
 *
 * @param       AHBPeriph:   specifies the AHB peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_AHB_PERIPH_DMA
 *                           @arg RCM_AHB_PERIPH_MEMITF
 *                           @arg RCM_AHB_PERIPH_SRAM
 *                           @arg RCM_AHB_PERIPH_CRC
 *                           @arg RCM_AHB_PERIPH_TSC
 *                           @arg RCM_AHB_PERIPH_RNG
 *                           @arg RCM_AHB_PERIPH_CRYP
 *
 * @retval      None
 */
void RCM_EnableSleepAHBPeriphClock(RCM_AHB_PERIPH_T AHBPeriph)
{
    RCM->SLPAHBEN |= AHBPeriph;
}

/*!
 * @brief       Disable SLPAHB peripheral clock
 *
 * @param       AHBPeriph:   specifies the SLPAHB peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_AHB_PERIPH_DMA
 *                           @arg RCM_AHB_PERIPH_MEMITF
 *                           @arg RCM_AHB_PERIPH_SRAM
 *                           @arg RCM_AHB_PERIPH_CRC
 *                           @arg RCM_AHB_PERIPH_TSC
 *                           @arg RCM_AHB_PERIPH_RNG
 *                           @arg RCM_AHB_PERIPH_CRYP
 *
 * @retval      None
 */
void RCM_DisableSleepAHBPeriphClock(RCM_AHB_PERIPH_T AHBPeriph)
{
    RCM->SLPAHBEN &= (uint32_t)~AHBPeriph;
}

/*!
 * @brief       Enables SLPAPB2 peripheral clock
 *
 * @param       APB2Periph:  specifies the SLPAPB2 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB2_PERIPH_SYSCFG
 *                           @arg RCM_APB2_PERIPH_TMR21
 *                           @arg RCM_APB2_PERIPH_TMR22
 *                           @arg RCM_APB2_PERIPH_ADC
 *                           @arg RCM_APB2_PERIPH_SPI1
 *                           @arg RCM_APB2_PERIPH_USART1
 *                           @arg RCM_APB2_PERIPH_DBG
 *
 * @retval      None
 */
void RCM_EnableSleepAPB2PeriphClock(RCM_APB2_PERIPH_T apb2Periph)
{
    RCM->SLPAPB2EN |= apb2Periph;
}

/*!
 * @brief       Disable SLPAPB2 peripheral clock
 *
 * @param       APB2Periph:  specifies the SLPAPB2 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB2_PERIPH_SYSCFG
 *                           @arg RCM_APB2_PERIPH_TMR21
 *                           @arg RCM_APB2_PERIPH_TMR22
 *                           @arg RCM_APB2_PERIPH_ADC
 *                           @arg RCM_APB2_PERIPH_SPI1
 *                           @arg RCM_APB2_PERIPH_USART1
 *                           @arg RCM_APB2_PERIPH_DBG
 *
 * @retval      None
 */
void RCM_DisableSleepAPB2PeriphClock(RCM_APB2_PERIPH_T apb2Periph)
{
    RCM->SLPAPB2EN &= (uint32_t)~apb2Periph;
}

/*!
 * @brief       Enables SLPAPB1 peripheral clock
 *
 * @param       APB1Periph:  specifies the SLPAPB1 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB1_PERIPH_TMR2
 *                           @arg RCM_APB1_PERIPH_TMR3
 *                           @arg RCM_APB1_PERIPH_TMR6
 *                           @arg RCM_APB1_PERIPH_TMR7
 *                           @arg RCM_APB1_PERIPH_LCD
 *                           @arg RCM_APB1_PERIPH_WWDT
 *                           @arg RCM_APB1_PERIPH_SPI2
 *                           @arg RCM_APB1_PERIPH_USART2
 *                           @arg RCM_APB1_PERIPH_LPUSART1
 *                           @arg RCM_APB1_PERIPH_USART4
 *                           @arg RCM_APB1_PERIPH_USART5
 *                           @arg RCM_APB1_PERIPH_I2C1
 *                           @arg RCM_APB1_PERIPH_I2C2
 *                           @arg RCM_APB1_PERIPH_USB
 *                           @arg RCM_APB1_PERIPH_CRS
 *                           @arg RCM_APB1_PERIPH_PMU
 *                           @arg RCM_APB1_PERIPH_DAC
 *                           @arg RCM_APB1_PERIPH_I2C3
 *                           @arg RCM_APB1_PERIPH_LPTMR1
 *
 * @retval      None
 */
void RCM_EnableSleepAPB1PeriphClock(RCM_APB1_PERIPH_T apb1Periph)
{
    RCM->SLPAPB1EN |= apb1Periph;
}

/*!
 * @brief       Disable SLPAPB1 peripheral clock
 *
 * @param       APB1Periph:  specifies the SLPAPB1 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB1_PERIPH_TMR2
 *                           @arg RCM_APB1_PERIPH_TMR3
 *                           @arg RCM_APB1_PERIPH_TMR6
 *                           @arg RCM_APB1_PERIPH_TMR7
 *                           @arg RCM_APB1_PERIPH_LCD
 *                           @arg RCM_APB1_PERIPH_WWDT
 *                           @arg RCM_APB1_PERIPH_SPI2
 *                           @arg RCM_APB1_PERIPH_USART2
 *                           @arg RCM_APB1_PERIPH_LPUSART1
 *                           @arg RCM_APB1_PERIPH_USART4
 *                           @arg RCM_APB1_PERIPH_USART5
 *                           @arg RCM_APB1_PERIPH_I2C1
 *                           @arg RCM_APB1_PERIPH_I2C2
 *                           @arg RCM_APB1_PERIPH_USB
 *                           @arg RCM_APB1_PERIPH_CRS
 *                           @arg RCM_APB1_PERIPH_PMU
 *                           @arg RCM_APB1_PERIPH_DAC
 *                           @arg RCM_APB1_PERIPH_I2C3
 *                           @arg RCM_APB1_PERIPH_LPTMR1
 *
 * @retval      None
 */
void RCM_DisableSleepAPB1PeriphClock(RCM_APB1_PERIPH_T apb1Periph)
{
    RCM->SLPAPB1EN &= (uint32_t)~apb1Periph;
}

/*!
 * @brief       Enables GPIO Reset
 *
 * @param       gpioClock:   specifies the GPIO to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_GPIO_CLOCK_A
 *                           @arg RCM_GPIO_CLOCK_B
 *                           @arg RCM_GPIO_CLOCK_C
 *                           @arg RCM_GPIO_CLOCK_D
 *                           @arg RCM_GPIO_CLOCK_E
 *                           @arg RCM_GPIO_CLOCK_H
 *
 * @retval      None
 */
void RCM_EnableGPIOReset(RCM_GPIO_CLOCK_T gpioClock)
{
    RCM->GPIORST |= gpioClock;
}

/*!
 * @brief       Disable GPIO Reset
 *
 * @param       gpioClock:   specifies the GPIO to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_GPIO_CLOCK_A
 *                           @arg RCM_GPIO_CLOCK_B
 *                           @arg RCM_GPIO_CLOCK_C
 *                           @arg RCM_GPIO_CLOCK_D
 *                           @arg RCM_GPIO_CLOCK_E
 *                           @arg RCM_GPIO_CLOCK_H
 *
 * @retval      None
 */
void RCM_DisableGPIOReset(RCM_GPIO_CLOCK_T gpioClock)
{
    RCM->GPIORST &= (uint32_t)~gpioClock;
}

/*!
 * @brief       Enables AHB peripheral Reset
 *
 * @param       AHBPeriph:   specifies the AHB peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_AHB_PERIPH_DMA
 *                           @arg RCM_AHB_PERIPH_MEMITF
 *                           @arg RCM_AHB_PERIPH_CRC
 *                           @arg RCM_AHB_PERIPH_TSC
 *                           @arg RCM_AHB_PERIPH_RNG
 *                           @arg RCM_AHB_PERIPH_CRYP
 *
 * @retval      None
 */
void RCM_EnableAHBPeriphReset(RCM_AHB_PERIPH_T AHBPeriph)
{
    RCM->AHBRST |= AHBPeriph;
}

/*!
 * @brief       Disable AHB peripheral Reset
 *
 * @param       AHBPeriph:   specifies the AHB peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_AHB_PERIPH_DMA
 *                           @arg RCM_AHB_PERIPH_MEMITF
 *                           @arg RCM_AHB_PERIPH_CRC
 *                           @arg RCM_AHB_PERIPH_TSC
 *                           @arg RCM_AHB_PERIPH_RNG
 *                           @arg RCM_AHB_PERIPH_CRYP
 *
 * @retval      None
 */
void RCM_DisableAHBPeriphReset(RCM_AHB_PERIPH_T AHBPeriph)
{
    RCM->AHBRST &= (uint32_t)~AHBPeriph;
}

/*!
 * @brief       Enables APB2 peripheral Reset
 *
 * @param       APB2Periph:  specifies the APB2 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB2_PERIPH_SYSCFG
 *                           @arg RCM_APB2_PERIPH_TMR21
 *                           @arg RCM_APB2_PERIPH_TMR22
 *                           @arg RCM_APB2_PERIPH_ADC
 *                           @arg RCM_APB2_PERIPH_SPI1
 *                           @arg RCM_APB2_PERIPH_USART1
 *                           @arg RCM_APB2_PERIPH_DBG
 *
 * @retval      None
 */
void RCM_EnableAPB2PeriphReset(RCM_APB2_PERIPH_T apb2Periph)
{
    RCM->APB2RST |= apb2Periph;
}

