frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rcm.c
/*!
 * @brief       Disable APB2 peripheral Reset
 *
 * @param       APB2Periph:  specifies the APB2 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB2_PERIPH_SYSCFG
 *                           @arg RCM_APB2_PERIPH_TMR21
 *                           @arg RCM_APB2_PERIPH_TMR22
 *                           @arg RCM_APB2_PERIPH_ADC
 *                           @arg RCM_APB2_PERIPH_SPI1
 *                           @arg RCM_APB2_PERIPH_USART1
 *                           @arg RCM_APB2_PERIPH_DBG
 *
 * @retval      None
 */
void RCM_DisableAPB2PeriphReset(RCM_APB2_PERIPH_T apb2Periph)
{
    RCM->APB2RST &= (uint32_t)~apb2Periph;
}

/*!
 * @brief       Enables APB1 peripheral Reset
 *
 * @param       APB1Periph:  specifies the APB1 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB1_PERIPH_TMR2
 *                           @arg RCM_APB1_PERIPH_TMR3
 *                           @arg RCM_APB1_PERIPH_TMR6
 *                           @arg RCM_APB1_PERIPH_TMR7
 *                           @arg RCM_APB1_PERIPH_WWDT
 *                           @arg RCM_APB1_PERIPH_SPI2
 *                           @arg RCM_APB1_PERIPH_USART2
 *                           @arg RCM_APB1_PERIPH_LPUSART1
 *                           @arg RCM_APB1_PERIPH_USART4
 *                           @arg RCM_APB1_PERIPH_USART5
 *                           @arg RCM_APB1_PERIPH_I2C1
 *                           @arg RCM_APB1_PERIPH_I2C2
 *                           @arg RCM_APB1_PERIPH_USB
 *                           @arg RCM_APB1_PERIPH_CRS
 *                           @arg RCM_APB1_PERIPH_PMU
 *                           @arg RCM_APB1_PERIPH_DAC
 *                           @arg RCM_APB1_PERIPH_I2C3
 *                           @arg RCM_APB1_PERIPH_LPTMR1
 *
 * @retval      None
 */
void RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_T apb1Periph)
{
    RCM->APB1RST |= apb1Periph;
}

/*!
 * @brief       Disable APB1 peripheral Reset
 *
 * @param       APB1Periph:  specifies the APB1 peripheral to gates its clock
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_APB1_PERIPH_TMR2
 *                           @arg RCM_APB1_PERIPH_TMR3
 *                           @arg RCM_APB1_PERIPH_TMR6
 *                           @arg RCM_APB1_PERIPH_TMR7
 *                           @arg RCM_APB1_PERIPH_WWDT
 *                           @arg RCM_APB1_PERIPH_SPI2
 *                           @arg RCM_APB1_PERIPH_USART2
 *                           @arg RCM_APB1_PERIPH_LPUSART1
 *                           @arg RCM_APB1_PERIPH_USART4
 *                           @arg RCM_APB1_PERIPH_USART5
 *                           @arg RCM_APB1_PERIPH_I2C1
 *                           @arg RCM_APB1_PERIPH_I2C2
 *                           @arg RCM_APB1_PERIPH_USB
 *                           @arg RCM_APB1_PERIPH_CRS
 *                           @arg RCM_APB1_PERIPH_PMU
 *                           @arg RCM_APB1_PERIPH_DAC
 *                           @arg RCM_APB1_PERIPH_I2C3
 *                           @arg RCM_APB1_PERIPH_LPTMR1
 *
 * @retval      None
 */
void RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_T apb1Periph)
{
    RCM->APB1RST &= (uint32_t)~apb1Periph;
}

/*!
 * @brief       Enable the specified RCM interrupts
 *
 * @param       interrupt:   specifies the RCM interrupt source to check
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_INT_LSI
 *                           @arg RCM_INT_LSE
 *                           @arg RCM_INT_HSI16
 *                           @arg RCM_INT_HSE
 *                           @arg RCM_INT_PLL
 *                           @arg RCM_INT_MSI
 *                           @arg RCM_INT_HSI48
 *                           @arg RCM_INT_CSSL
 *
 * @retval  None
 */
void RCM_EnableInterrupt(RCM_INT_T interrupt)
{
    RCM->INTEN |= (uint8_t)interrupt;
}

/*!
 * @brief       Disable the specified RCM interrupts
 *
 * @param       interrupt:   specifies the RCM interrupt source to check
 *                           This parameter can be any combination of the following values:
 *                           @arg RCM_INT_LSI
 *                           @arg RCM_INT_LSE
 *                           @arg RCM_INT_HSI16
 *                           @arg RCM_INT_HSE
 *                           @arg RCM_INT_PLL
 *                           @arg RCM_INT_MSI
 *                           @arg RCM_INT_HSI48
 *                           @arg RCM_INT_CSSL
 *
 * @retval  None
 */
void RCM_DisableInterrupt(uint8_t interrupt)
{
    RCM->INTEN &= (uint8_t)~interrupt;
}

/*!
 * @brief       Read the specified RCM flag status
 *
 * @param       flag:   specifies the flag to check
 *                      This parameter can be one of the following values:
 *                      @arg RCM_FLAG_HSI16RDY
 *                      @arg RCM_FLAG_HSI16DIV
 *                      @arg RCM_FLAG_MSIRDY
 *                      @arg RCM_FLAG_HSERDY
 *                      @arg RCM_FLAG_PLLRDY
 *                      @arg RCM_FLAG_HSI48RDY
 *                      @arg RCM_FLAG_LSIRDY
 *                      @arg RCM_FLAG_LSERDY
 *                      @arg RCM_FLAG_CSSLFAIL
 *                      @arg RCM_FLAG_FWLRST
 *                      @arg RCM_FLAG_OBLRST
 *                      @arg RCM_FLAG_PINRST
 *                      @arg RCM_FLAG_PODRRST
 *                      @arg RCM_FLAG_SWRST
 *                      @arg RCM_FLAG_IWDTRST
 *                      @arg RCM_FLAG_WWDTRST
 *                      @arg RCM_FLAG_LPRRST
 *
 * @retval      The new state of flag (SET or RESET)
 */
uint16_t RCM_ReadStatusFlag(RCM_FLAG_T flag)
{
    uint32_t reg, bit;

    bit = (uint32_t)(1 << (flag & 0xff));

    reg = (flag >> 8) & 0xff;

    switch (reg)
    {
        case 0:
            reg = RCM->CTRL;
            break;

        case 1:
            reg = RCM->HSI48CFG;
            break;

