frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rcm.c
        case 2:
            reg = RCM->CSTS;
            break;

        default:
            break;
    }

    if (reg & bit)
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clears the RCM reset flags
 *
 * @param       None
 *
 * @retval      None
 *
 * @note        The reset flags are:
 *              @arg RCM_FLAG_FWLRST
 *              @arg RCM_FLAG_OBLRST
 *              @arg RCM_FLAG_PINRST
 *              @arg RCM_FLAG_PODRRST
 *              @arg RCM_FLAG_SWRST
 *              @arg RCM_FLAG_IWDTRST
 *              @arg RCM_FLAG_WWDTRST
 *              @arg RCM_FLAG_LPRRST
 */
void RCM_ClearStatusFlag(void)
{
    RCM->CSTS_B.RSTFLGCLR = BIT_SET;
}

/*!
 * @brief       Read the specified RCM interrupt Flag
 *
 * @param       flag:   specifies the RCM interrupt source to check
 *                      This parameter can be one of the following values:
 *                      @arg RCM_INT_LSI
 *                      @arg RCM_INT_LSE
 *                      @arg RCM_INT_HSI16
 *                      @arg RCM_INT_HSE
 *                      @arg RCM_INT_PLL
 *                      @arg RCM_INT_MSI
 *                      @arg RCM_INT_HSI48
 *                      @arg RCM_INT_CSSL
 *                      @arg RCM_INT_HCSS
 *
 * @retval      The new state of intFlag (SET or RESET)
 */
uint8_t RCM_ReadIntFlag(RCM_INT_T flag)
{
    uint8_t ret;

    ret = (RCM->INTSTS & flag) ? SET : RESET;

    return  ret;
}

/*!
 * @brief       Clears the interrupt flag
 *
 * @param       flag:   specifies the RCM interrupt source to check
 *                      This parameter can be any combination of the following values:
 *                      @arg RCM_INT_LSI
 *                      @arg RCM_INT_LSE
 *                      @arg RCM_INT_HSI16
 *                      @arg RCM_INT_HSE
 *                      @arg RCM_INT_PLL
 *                      @arg RCM_INT_MSI
 *                      @arg RCM_INT_HSI48
 *                      @arg RCM_INT_CSSL
 *                      @arg RCM_INT_HCSS
 *
 * @retval      None
 */
void RCM_ClearIntFlag(uint8_t flag)
{
    RCM->INTCLR |= flag;
}

/**@} end of group RCM_Fuctions*/
/**@} end of group RCM_Driver*/
/**@} end of group Peripherals_Library*/
